app/controllers/animals_controller.rb

  def create
    @animal = Animal.create animal_params
---
INSERT INTO "animals" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 29 May 2013 22:09:32 UTC +00:00], ["name", "Chicken"], ["updated_at", Wed, 29 May 2013 22:09:32 UTC +00:00]]

  def update
    @animal.update_attributes animal_params
---
UPDATE "animals" SET "name" = 'Super Chicken', "updated_at" = '2013-05-29 22:09:32.851198' WHERE "animals"."id" = 1

  def destroy
    @animal.destroy
---
DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]

    def find_animal
      @animal = Animal.find params[:id]
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", "1"]]