app/controllers/primal_cuts_controller.rb

SELECT "cuts".* FROM "cuts" WHERE "cuts"."primal_cut_id" = 1
SELECT "primal_cuts".* FROM "primal_cuts" WHERE "primal_cuts"."animal_id" = 1
---
  def index
    @primal_cuts = @animal.primal_cuts.all

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", "1"]]
---
    def find_animal
      animal_id = params[:animal_id] || params[:primal_cut][:animal_id]
      @animal = Animal.find animal_id

SELECT "primal_cuts".* FROM "primal_cuts" WHERE "primal_cuts"."id" = ? LIMIT 1  [["id", "3"]]
---
    def find_primal_cut
      @primal_cut = PrimalCut.find params[:id]